app/controllers/restaurants_controller.rb

INSERT INTO "restaurants" ("name", "rating", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "My restaurant"], ["rating", 5], ["description", "A great place to eat"], ["created_at", 2016-11-15 09:26:33 UTC], ["updated_at", 2016-11-15 09:26:33 UTC]]
---
	def create
		@restaurant = current_user.build_restaurant(restaurant_params, current_user)
		if @restaurant.save

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
UPDATE "restaurants" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "restaurants"."id" = $4  [["name", "trat"], ["description", ""], ["updated_at", 2016-11-15 09:26:33 UTC], ["id", 18]]
---
	def update
		@restaurant = Restaurant.find(params[:id])
		@restaurant.update(restaurant_params)

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 66], ["LIMIT", 1]]
DELETE FROM "restaurants" WHERE "restaurants"."id" = $1  [["id", 66]]
---
	def destroy
		restaurant = Restaurant.find(params[:id])
		restaurant.destroy