app/controllers/reviews_controller.rb

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "reviews" ("comments", "rating", "restaurant_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["comments", "hmhv"], ["rating", 2], ["restaurant_id", 1], ["created_at", 2016-11-17 11:10:04 UTC], ["updated_at", 2016-11-17 11:10:04 UTC], ["user_id", 1]]
UPDATE "restaurants" SET "rating" = $1, "updated_at" = $2 WHERE "restaurants"."id" = $3  [["rating", 5.0], ["updated_at", 2016-11-17 17:11:26 UTC], ["id", 8]]
---
  def create
    @restaurant = Restaurant.find(params[:restaurant_id])
    @review = @restaurant.build_review(review_params, current_user)
    if @review.save

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "restaurants" SET "rating" = $1, "updated_at" = $2 WHERE "restaurants"."id" = $3  [["rating", 4.0], ["updated_at", 2016-11-17 17:11:41 UTC], ["id", 8]]
UPDATE "reviews" SET "comments" = $1, "rating" = $2, "updated_at" = $3 WHERE "reviews"."id" = $4  [["comments", "Nice again"], ["rating", 4], ["updated_at", 2016-11-17 16:09:20 UTC], ["id", 5]]
---
	def update
		@review = Review.find(params[:id])
    @restaurant = @review.restaurant
		if @review.user == current_user
		  @review.update(review_params)

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 5]]
UPDATE "restaurants" SET "rating" = $1, "updated_at" = $2 WHERE "restaurants"."id" = $3  [["rating", 0.0], ["updated_at", 2016-11-17 18:06:03 UTC], ["id", 2]]
---
	def destroy
	 review = Review.find(params[:id])
   @restaurant = review.restaurant
		if review.user == current_user
			review.destroy
			@restaurant.update_rating